БухЭксп/InformationRegisters/ИспользованиеФункциональностиПоОрганизациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИспользованиеФункциональностиПоОрганизациям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормированиеУставногоКапиталаПростойИнтерфейс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтерфейсТаксиПростойИПиЮрЛица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьРазделАУСНПоТекущимЗадачам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьРазделУСНПоТекущимЗадачам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьРазделПСНПоТекущимЗадачам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьРазделНДФЛИППоТекущимЗадачам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьРазделНПДПоТекущимЗадачам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьРазделНДСПоТекущимЗадачам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьРазделПрибыльПоТекущимЗадачам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/ИспользованиеФункциональностиПоОрганизациям/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановитьЗначенияПриОбновленииИБ");
	Методы.Вставить("ОбновитьЗначенияОпцииПростогоИнтерфейса");
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Обработчик первоначального заполнения видимости команд раздела Организация
//
Процедура УстановитьЗначенияПриОбновленииИБ() Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЗаполнитьОпцииПростогоИнтерфейса(НаборЗаписей);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	
КонецПроцедуры

// Обработчик заполнения функциональных опций для разделов Организация, Налоги
//
// Параметры:
//   ПараметрыВыполнения - Структура - Параметры обработчика обновления в отложенном режиме
//
Процедура ОбновитьЗначенияОпцииПростогоИнтерфейса(ПараметрыВыполнения = Неопределено) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЗаполнитьОпцииПростогоИнтерфейса(НаборЗаписей);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

// Устанавливает видимость команд раздела Организация
//
Процедура УстановитьЗначения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = СоздатьНаборЗаписей();
	ЗаполнитьОпцииПростогоИнтерфейса(НаборЗаписей);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Устанавливает видимость команд элемента справочника Организации
//
// Параметры:
//   Организация - СправочникСсылка.Организации
//
Процедура УстановитьЗначенияПоОрганизации(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	ЗаполнитьОпцииПростогоИнтерфейса(НаборЗаписей, Организация);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОпцииПростогоИнтерфейса(НаборЗаписей, Организация = Неопределено)
	
	ЭтоПростойИнтерфейс = ОбщегоНазначенияБП.ЭтоПростойИнтерфейс();
	
	Если Организация <> Неопределено Тогда
		Организации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	Иначе
		Организации = Неопределено;
	КонецЕсли;
	ВидыОрганизаций = Справочники.Организации.ВидыОрганизаций(Организации);
	ДоступныеФункции = ПараметрыДоступныхФункцийНезакрытыхЗадач(Организации);
	ОтборФункций = Новый Структура("Организация");
	
	Для Каждого ВидОрганизации Из ВидыОрганизаций Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.Организация = ВидОрганизации.Организация;
		Запись.ФормированиеУставногоКапиталаПростойИнтерфейс = ЭтоПростойИнтерфейс И ВидОрганизации.ЭтоЮрЛицо;
		Запись.ИнтерфейсТаксиПростойИПиЮрЛица = ЭтоПростойИнтерфейс И ОрганизацияЗарегистрированаВЕГРЮЛ(ВидОрганизации);
		
		ОтборФункций.Организация = ВидОрганизации.Организация;
		СтрокиОтбора = ДоступныеФункции.НайтиСтроки(ОтборФункций);
		Если СтрокиОтбора.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Запись, СтрокиОтбора[0], , "Организация");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыДоступныхФункцийНезакрытыхЗадач(Организации)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачиБухгалтера.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ЗадачиБухгалтера.Правило КАК Справочник.ПравилаПредставленияОтчетовУплатыНалогов).Владелец.Код КАК КодЗадачи
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Статус = """"
	|	И НЕ ЗадачиБухгалтера.ВАрхиве
	|	И ЗадачиБухгалтера.Срок МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗадачиБухгалтера.Правило ССЫЛКА Справочник.ПравилаПредставленияОтчетовУплатыНалогов
	|ИТОГИ ПО
	|	Организация");
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(Запрос.Параметры.ДатаНачала));
	
	Если ЗначениеЗаполнено(Организации) Тогда
		Схема = Новый СхемаЗапроса();
		Схема.УстановитьТекстЗапроса(Запрос.Текст);
		Схема.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("ЗадачиБухгалтера.Организация В (&Организации)");
		Запрос.УстановитьПараметр("Организации", Организации);
		Запрос.Текст = Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	ВыборкаПоОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДоступныеФункции = ДоступныеФункцииПоКодамЗадач();
	
	Результат = НовыеПараметрыДоступныхФункций();
	Пока ВыборкаПоОрганизации.Следующий() Цикл
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Организация = ВыборкаПоОрганизации.Организация;
		Выборка = ВыборкаПоОрганизации.Выбрать();
		Пока Выборка.Следующий() Цикл
			КлючСвойства = ДоступныеФункции.Получить(Выборка.КодЗадачи);
			Если КлючСвойства <> Неопределено Тогда
				НоваяСтрока[КлючСвойства] = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Результат.Индексы.Добавить("Организация");
	Возврат Результат;
	
КонецФункции

Функция НовыеПараметрыДоступныхФункций()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	ТипКолонкиФункции = Новый ОписаниеТипов("Булево");
	
	Для Каждого ТекущаяФункция Из ДоступныеФункцииПоКодамЗадач() Цикл
		Результат.Колонки.Добавить(ТекущаяФункция.Значение, ТипКолонкиФункции);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДоступныеФункцииПоКодамЗадач()
	
	Результат = Новый Соответствие;
	Результат.Вставить(ЗадачиБухгалтераКлиентСервер.КодЗадачиАУСН(), "ОтображатьРазделАУСНПоТекущимЗадачам");
	Результат.Вставить(ЗадачиБухгалтераКлиентСервер.КодЗадачиУСН(), "ОтображатьРазделУСНПоТекущимЗадачам");
	Результат.Вставить(ЗадачиБухгалтераКлиентСервер.КодЗадачиПатент(), "ОтображатьРазделПСНПоТекущимЗадачам");
	Результат.Вставить(ЗадачиБухгалтераКлиентСервер.КодЗадачиНДФЛПредприниматель(), "ОтображатьРазделНДФЛИППоТекущимЗадачам");
	Результат.Вставить(ЗадачиБухгалтераКлиентСервер.КодЗадачиНалогНаПрофессиональныйДоход(), "ОтображатьРазделНПДПоТекущимЗадачам");
	Результат.Вставить(ЗадачиБухгалтераКлиентСервер.КодЗадачиНДС(), "ОтображатьРазделНДСПоТекущимЗадачам");
	Результат.Вставить(ЗадачиБухгалтераКлиентСервер.КодЗадачиНалогНаПрибыль(), "ОтображатьРазделПрибыльПоТекущимЗадачам");
	
	Возврат Результат;
	
КонецФункции

Функция ОрганизацияЗарегистрированаВЕГРЮЛ(ВидОрганизации)
	
	Возврат ВидОрганизации.ЭтоЮрЛицо Или ВидОрганизации.ЭтоИП;
	
КонецФункции

#КонецОбласти

#КонецЕсли
